
/* ======================================== */
/* TODO: НАЗНАЧЕНИЕ ФАЙЛА */


/* ======================================== */
/* TODO: ВКЛЮЧАЕМЫЕ ФАЙЛЫ */

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>

#include "defs.h"


/* This file will be automatically included in OBJ in Makefile because of *.c pattern */


/* ======================================== */
/* TODO: ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ */


/* ======================================== */
/* TODO: ОБЪЯВЛЕНИЯ ФУНКЦИЙ */


/* ======================================== */
/* TODO: ВНУТРЕННИЕ ФУНКЦИИ */


/* ======================================== */
/* TODO: ВНЕШНИЕ ФУНКЦИИ */
